Tekla Open API Reference for Tekla Structures 2025
InputDefinitionFactory.GetDrawingObject Method
 Gets the object from the given single-object input.
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static DrawingObject GetDrawingObject(
	DrawingPluginBase.InputDefinition input
)
Public Shared Function GetDrawingObject (
	input As DrawingPluginBase.InputDefinition
) As DrawingObject
Parameters
input
Type: Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition
The input.
Return Value
Type: DrawingObject
The object.
See Also
Reference
InputDefinitionFactory Class
Tekla.Structures.Drawing.Tools Namespace